# <font color='blue'>Curso de Extensão - Análise de Dados em Python - Aula 2 - Exercícios</font>

## Exercícios Aula 2 (Numpy, pandas)

In [2]:
import numpy as np
import pandas as pd

#### 1) Crie o dataframe "medidas_df" contendo informações de peso e altura a partir do dicionário a seguir:

In [16]:
medidas_dict = {'Peso': (9999, 67, 70, np.NAN, 86, 62, 75, 69, 50, 222),
                'Altura': (1.79, 1.65, 1.75, 1.60, 1.55, 9999, np.NAN, np.NAN, 1.82, np.NAN),
        }
print(medidas_dict)

{'Peso': (9999, 67, 70, nan, 86, 62, 75, 69, 50, 222), 'Altura': (1.79, 1.65, 1.75, 1.6, 1.55, 9999, nan, nan, 1.82, nan)}

#### 2) Crie um novo dataframe que receba o dataframe "medidas_df" contendo os valores ruidosos substituídos por nullo (NaN).

#### 3) Crie um novo dataframe que receba o dataframe do exercício 2 contendo os valores nulos substituídos por valores reais. Escolha uma medida para realizar a substituição que pode ser média, mediana, min, max, etc.

#### 4) Carregue uma tabela utilizando uma url, e atribua o DataFrame a uma variável chamada ```chipo_df```

URL: https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv

In [3]:
#utilize o método read_csv
chipo_df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv', sep='\t', header=0)

In [4]:
chipo_df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [5]:
chipo_df.describe()

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

#### 5) Verifique a quantidade de linhas e colunas do dataframe ```chipo_df``` e imprima o nome das colunas.

#### 6) Ordene o dataframe ```chipo_df``` de acordo com o nome dos itens. Utilize o método df.sort_values().

#### 7) Exclua a 6ª e 14ª linhas do dataframe ```chipo_df```.

#### 8) Crie uma função que calcule e retorne a quantidade de Steak Burrito vendidos no dataframe ```chipo_df```.

#### 9) Calcule o valor total vendido de cada item. Para tal será necessário transformar o campo item_price para numérico da seguinte forma:

In [6]:
#Elimina o $ da frente do valor
#Apply é um método usado para aplicar uma função em cada registro de uma determinada coluna ou linha.
chipo_df.item_price = chipo_df.item_price.apply(lambda x: x.replace('$',''))
chipo_df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [8]:
#Converte os valores da coluna de string para numérico
chipo_df.item_price = pd.to_numeric(chipo_df.item_price, errors='coerce')
chipo_df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

#### 10) Verifique quais foram os valores de venda média, mínima e máxima do dataframe ```chipo_df```.

#### 11) Quantos produtos custam mais que \$10.00 no dataframe ```chipo_df``` ?

#### 12) Adicione mais uma coluna chamada delivery ao final do dataframe ```chipo_df``` que contenha o valor final com a adição de 3% de taxa de entrega para cada venda, arredondando os valores para 2 casas decimais.

#### 13) Calcule quantas vezes o produto Canned Soda foi vendido mais do que uma vez em uma mesma venda (quantidade >1) no dataset ```chipo_df```.